{
  "sections": [
    {
      "id": "detox-your-ex",
      "header": "Detox Your Ex: Stop Craving Their Texts",
      "lessons": [
        {
          "id": "detox-1",
          "title": "Your Brain On Breakup: Why It Feels Like Withdrawal",
          "subtitle": "This is not you being dramatic, this is your nervous system freaking out.",
          "content": [
            "Romantic love lights up the same reward circuits in your brain as addictive apps, sugar, and substances, so when the relationship ends it literally feels like losing your favorite drug.",
            "Your body starts searching for the old hits of validation and attention, which is why you catch yourself stalking, rereading chats, or waiting for their name to pop up on your screen.",
            "Once you understand this is a brain chemistry crash, not proof that they were your soulmate, you can stop romanticizing the pain and start treating it like a detox phase you will move through."
          ]
        },
        {
          "id": "detox-2",
          "title": "No-Contact, But Make It Powerful (Not Petty)",
          "subtitle": "No contact is not a mind game, it is a self-respect move.",
          "content": [
            "Going no-contact is less about punishing them and more about finally giving your mind the quiet it needs to heal, think clearly, and stop negotiating your own worth.",
            "Every time you reply to a dry text, check if they watched your story, or keep the streak alive, you are feeding the same loop that broke you in the first place.",
            "Decide your no-contact rules in advance, write them down, and treat them like a contract with your future self, so when the urge hits you follow the plan instead of the impulse."
          ]
        },
        {
          "id": "detox-3",
          "title": "Block, Mute, Archive: Digital Rules For A Real Reset",
          "subtitle": "If your phone is a trigger, you need boundaries, not more willpower.",
          "content": [
            "Your brain cannot heal if every scroll shows their face, their new posts, or old memories sitting in your chat list waiting to be reopened at 1 a.m.",
            "Blocking, muting, or archiving is not overreacting, it is clearing the mental clutter so you are not fighting a boss-level temptation every time you unlock your phone.",
            "Curate your feed with accounts that make you feel grounded, inspired, and seen, so your screen starts reinforcing your healing instead of dragging you back into the past."
          ]
        },
        {
          "id": "detox-4",
          "title": "Catching Yourself Before The \"Just One Text\" Relapse",
          "subtitle": "The urge to send a long paragraph is usually a sign you need closure from you, not from them.",
          "content": [
            "The 'just one text' fantasy usually sounds like you explaining everything perfectly and them finally getting it, apologizing, and fixing the past.",
            "In reality, that text often leads to another confusing reply, another fight, or another wave of disappointment that sets your healing back days or weeks.",
            "When the urge hits, pause for five minutes, write the message in your notes instead, and then do one small regulating action for your body so the craving passes without you reopening the door."
          ]
        },
        {
          "id": "detox-5",
          "title": "Turning Heartbreak Into Main-Character Plot Fuel",
          "subtitle": "If this is your villain origin story, you also get to write the comeback arc.",
          "content": [
            "Every breakup exposes where you abandoned yourself, ignored your needs, or accepted crumbs, which makes this the perfect moment to upgrade your standards.",
            "Instead of only asking why they did what they did, start asking what this version of you refuses to tolerate ever again and what future you actually deserves.",
            "Use the energy from the heartbreak to fuel a season of building: better habits, better boundaries, better environments, and a life so full that getting them back stops being the main goal."
          ]
        }
      ]
    },
    {
      "id": "main-character-energy",
      "header": "Main Character Energy: Rebuild Your Identity",
      "lessons": [
        {
          "id": "mce-1",
          "title": "You Are Not Their Opinion: Reclaiming Your Self-Image",
          "subtitle": "The breakup did not downgrade your value, it just removed the wrong mirror.",
          "content": [
            "When someone pulls away, cheats, or treats you like an option, your brain quickly starts building a story that you were not enough, even if their behavior had nothing to do with your worth.",
            "Their version of you was filtered through their own wounds, immaturity, and fears, which means it was never an accurate reflection, just a projection they put on you.",
            "Your job now is to unfollow that story and consciously collect proof of who you actually are: your strengths, your growth, your values, and the way people who truly care show up for you."
          ]
        },
        {
          "id": "mce-2",
          "title": "From \"We\" To \"Me\": Rewriting Your Daily Routine",
          "subtitle": "If your whole day was built around them, it is time to redesign the schedule around you.",
          "content": [
            "Breakups feel extra empty when your habits, calls, and check-ins used to orbit around another person and suddenly there is just silence in those time slots.",
            "Instead of trying to fill that silence with random distractions or rebound conversations, intentionally plug in routines that recharge you: movement, learning, journaling, or small wins for your goals.",
            "Treat your day like a personal playlist you curate on purpose so your energy is no longer dependent on whether they text or not."
          ]
        },
        {
          "id": "mce-3",
          "title": "Hobbies, Side Quests, And Finding Your Thing Again",
          "subtitle": "Main characters have side quests, not just side characters.",
          "content": [
            "Relationships can make you slowly drop the hobbies, interests, and weird little passions that used to make you feel alive before you met them.",
            "Start by revisiting things you liked as a kid or teen before you cared what anyone thought—art, games, music, sports, writing, building something, anything that makes you lose track of time.",
            "Your goal is not to become hyper-productive, it is to remember what lights you up when no one is watching so your life feels bigger than just dating."
          ]
        },
        {
          "id": "mce-4",
          "title": "Social Glow-Up: Curating A Circle That Actually Sees You",
          "subtitle": "You don’t just need people around you, you need people who are for you.",
          "content": [
            "After a breakup, some people disappear, some stay neutral, and a few quietly step up for you—pay attention to who lands in which category.",
            "Start giving more time and emotional access to the friends who hype your growth, hold you accountable, and make you feel safe to be honest instead of judged.",
            "Healing becomes way easier when your environment is full of people who remind you who you are, not just who you were with your ex."
          ]
        },
        {
          "id": "mce-5",
          "title": "Future You Would Be Proud: Designing Your Next Chapter",
          "subtitle": "If your life is a series, this breakup is just the end of one season, not the show.",
          "content": [
            "Instead of obsessing over what you lost, start scripting what future you wants to be feeling, doing, and surrounded by six to twelve months from now.",
            "Break that vision down into tiny, realistic moves you can start this week: a new skill, a healthier habit, a money goal, a boundary you finally enforce.",
            "The more you invest in that next chapter, the less appealing it becomes to go back to a storyline where you kept shrinking yourself to keep the peace."
          ]
        }
      ]
    },
    {
      "id": "red-flag-radar",
      "header": "Red Flag Radar: Never Miss The Signs Again",
      "lessons": [
        {
          "id": "rfr-1",
          "title": "Love Bombing vs. Real Effort: Spotting The Difference",
          "subtitle": "Not every intense connection is healthy—some are just fast-tracked chaos.",
          "content": [
            "Love bombing feels like a movie montage at the start: constant compliments, long calls, big promises, and a rush that makes you ignore how little time you actually know this person.",
            "Real effort builds slowly and consistently over time, with actions that match words and a pace that respects your comfort instead of pushing you to commit before you even feel grounded.",
            "If the connection feels like a high you are scared to lose rather than a calm you can relax into, that intensity might be a red flag, not proof that they are \"the one.\""
          ]
        },
        {
          "id": "rfr-2",
          "title": "Mixed Signals Are Still A Signal (And It’s Not Green)",
          "subtitle": "If you have to decode their behavior like it is a puzzle, the answer is already no.",
          "content": [
            "Mixed signals look like heavy flirting one day and cold distance the next, sweet words with zero follow-through, or someone who wants your energy but avoids real commitment.",
            "When you care, it is tempting to become their personal therapist, excuse-maker, and translator, constantly telling yourself they are just \"busy,\" \"confused,\" or \"not ready.\"",
            "Clear interest feels obvious, steady, and safe, so if you are anxious-refreshing chats and asking all your friends what that last text meant, your body is picking up a red flag your mind is trying to ignore."
          ]
        },
        {
          "id": "rfr-3",
          "title": "When Chemistry Made You Ignore Compatibility",
          "subtitle": "The spark was real, but so were the reasons it couldn’t work.",
          "content": [
            "Chemistry can make you feel like you have found your person on the first date, but long-term relationships are built on boring-sounding things like values, goals, communication, and emotional maturity.",
            "You can be insanely attracted to someone who is not ready for commitment, doesn’t want the same future, or cannot show up consistently, and that is not something you can fix with more love.",
            "Looking back at when you overrode your intuition, your standards, or your non-negotiables \"because the connection was different\" helps you train yourself to choose compatibility over chaos next time."
          ]
        },
        {
          "id": "rfr-4",
          "title": "Bare Minimum Energy: Why You Kept Accepting Less",
          "subtitle": "Answering your texts is not a personality trait or a grand gesture.",
          "content": [
            "When your self-worth quietly slips, you start treating basic decency—like replying, not lying, or spending time with you—as if it is elite behavior you should be grateful for.",
            "You might have stayed because you were scared of being alone, thought you would never find better, or believed that if you just loved them right, they would finally step up.",
            "Recognizing where you lowered the bar helps you raise it back to normal: consistency, honesty, respect, and effort are the starting point, not the prize."
          ]
        },
        {
          "id": "rfr-5",
          "title": "Building Non-Negotiables So You Don’t Repeat The Past",
          "subtitle": "Standards are not you being picky; they are you protecting your peace.",
          "content": [
            "Non-negotiables are the few core things you refuse to compromise on again, like emotional availability, communication style, or how conflict is handled.",
            "Instead of making the list aesthetic and then ignoring it when someone attractive shows up, use it as an actual filter: if they fail the basics early, you exit early.",
            "Every time you walk away from someone who cannot meet your standards, you teach your brain that you are safe with yourself—and that is the real upgrade."
          ]
        }
      ]
    },
    {
      "id": "soft-life-reset",
      "header": "Soft Life Reset: Calm Your Nervous System",
      "lessons": [
        {
          "id": "slr-1",
          "title": "Overthinking At 2AM: Getting Out Of The Thought Spiral",
          "subtitle": "Your brain loves drama at night; you don’t have to attend every mental argument.",
          "content": [
            "Nighttime makes small problems feel massive because your brain has fewer distractions and more space to replay every conversation, text, and red flag on loop.",
            "Instead of trying to \"think your way\" out of the spiral, give your mind a different job: write down the worries in a note, label them as \"tomorrow problems,\" and gently bring your focus back to your body or your breath.",
            "You are allowed to decide that 2AM is not the time for life decisions and train yourself to revisit those thoughts in the daylight when your nervous system is calmer."
          ]
        },
        {
          "id": "slr-2",
          "title": "Body First, Feelings Second: Simple Nervous System Hacks",
          "subtitle": "You can’t mindset your way out of a dysregulated body.",
          "content": [
            "When your heart is racing, your chest is tight, or your stomach drops after a trigger, your nervous system is in survival mode, and no amount of \"just don’t care\" talk will fix it.",
            "Start with simple grounding moves: cold water on your face, slow exhale-focused breathing, pressing your feet into the floor, or naming five things you can see in the room.",
            "Once your body feels even a little safer, your thoughts instantly become less extreme, and you can respond instead of react."
          ]
        },
        {
          "id": "slr-3",
          "title": "Trading Drama For Peace (Without Feeling Boring)",
          "subtitle": "Peace is not boring; you’re just detoxing from emotional rollercoasters.",
          "content": [
            "If you grew used to chaotic relationships, stable connections and quiet days can feel uncomfortable, empty, or even wrong at first.",
            "Your brain might miss the highs and lows because they created adrenaline and intensity, but that doesn’t mean those dynamics were good for you.",
            "The more you choose calm over chaos—blocking arguments, not engaging with bait, leaving when energy feels off—the more your system learns that peace is actually the flex."
          ]
        },
        {
          "id": "slr-4",
          "title": "Micro-Habits That Quiet Anxiety After A Text Or Trigger",
          "subtitle": "You don’t need a full routine; sometimes you just need a 30-second reset.",
          "content": [
            "Anxiety spikes fast when you see their name pop up, spot a reminder, or hear a song that takes you straight back to them.",
            "Instead of spiraling, build tiny go-to habits: stand up and shake out your body, step outside for fresh air, drink some water, or put your phone face down and breathe slowly for ten counts.",
            "These micro-resets teach your brain that you can feel a wave of emotion and still stay in control, without replying, stalking, or self-sabotaging."
          ]
        },
        {
          "id": "slr-5",
          "title": "Soft Life Standards: What You Will And Won’t Tolerate Now",
          "subtitle": "Soft life is not laziness; it’s intentional protection of your energy.",
          "content": [
            "Soft life after heartbreak means choosing environments, conversations, and relationships that feel safe and supportive instead of loud and draining.",
            "Make a short list of what you refuse to entertain now—arguing in DMs, second chances for the same behavior, situationships with no clarity—and what you welcome instead.",
            "The more you act like your peace is expensive, the more your future connections will have to rise to that level or lose access to you."
          ]
        }
      ]
    }
  ]
}


